ticketing_backend/app/controllers/sessions_controller.rb

SELECT  1 AS one FROM `users` WHERE `users`.`email` = 'customer1@email.com' AND (`users`.`id` != 1) LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'customer1@email.com' LIMIT 1
UPDATE `users` SET `auth_token` = 'Z1K3Uwyondi5r4Z8qxqm', `updated_at` = '2016-09-13 05:13:47' WHERE `users`.`id` = 1
---
  def create
    user_password = params[:user][:password]
    user_email    = params[:user][:email]
    user = user_email.present? && User.find_by(email: user_email)
    if user.present? && user.valid_password?(user_password)
      #user.generate_authentication_token!
      user.save(validate: false)