ticketing_backend/app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` WHERE (id = 1)
---
      def index
        if current_user.admin?
          @users = User.all